In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv('salarios_medios_por_tipo_de_jornada,_grupo_de_edad_y_decil_limpio.csv')

In [3]:
df2 = pd.read_csv('indice_precios_vivienda_alquiler_limpio.csv')

In [4]:
df3 = pd.read_csv('informe_de_precios_en_alquiler_españa_limpio.csv')

In [5]:
df1

             Tipo de jornada  Periodo     Total  Porcentajes
0  Jornada a tiempo completo     2008  1540.700     0.000000
1  Jornada a tiempo completo     2020  1720.875    11.694360
2   Jornada a tiempo parcial     2008   665.395     6.178662
3   Jornada a tiempo parcial     2020   709.215     0.000000

In [10]:
df2

  Municipios  Precio/m2  Superficie
0  Barcelona         11        68.0
1     Madrid         11        66.0
2     Málaga          7        79.0
3    Sevilla          7        77.0
4   Valencia          5        85.0
5   Zaragoza          6        73.0

In [11]:
df3

        Localización  Precio m2 abr 2022
0          Barcelona                  16
1             Madrid                  15
2             Málaga                  10
3            Sevilla                  10
4  Valencia/Valéncia                   8
5           Zaragoza                   8

In [16]:
df = pd.concat([df2, df3], axis = 1)
df['Salario medio jornada completa'] = [1720, 1720, 1720, 1720, 1720, 1720]

In [22]:
df['Precio/m2'] = df['Precio/m2'] * 85

In [23]:
df['Precio m2 abr 2022'] = df['Precio m2 abr 2022'] * 85

In [25]:
df.to_csv('scrollama_grafico.csv', index = False)